/******************************************************Copyright (c)**************************************************
**                                              胆怯是阻止一切可能的根本缘由
**
**                                             E-Mail: ChinaFengliang@163.com
**
**---------File Information-------------------------------------------------------------------------------------------
** File name:            commmand.c
** Last version:         V1.00
** Descriptions:         控制台命令文件.
** Hardware platform:    
** SoftWare platform:    ChinaOS
**
**--------------------------------------------------------------------------------------------------------------------
** Created by:           Feng Liang
** Created date:         2012年2月8日  20:44:4
** Version:              V1.00
** Descriptions:         The original version
**
**--------------------------------------------------------------------------------------------------------------------
** Modified by: 
** Modified date:
** Version:
** Descriptions:
**
*********************************************************************************************************************/

/*********************************************************************************************************************
                                                    头文件区
*********************************************************************************************************************/
#include    <include/macro.h>
#include    <include/types.h>
#include    <kernel/kernel.h>
#include    <library/printk.h>
#include    <library/sysio/sysio.h>
#include    <library/time.h>


/*********************************************************************************************************************
                                                    宏定义区
*********************************************************************************************************************/
/* 宏段名 ----------------------------------------------------------------------------------------------------------*/


/*********************************************************************************************************************
                                                    类型定义区
*********************************************************************************************************************/
/* 基本类型 --------------------------------------------------------------------------------------------------------*/


/*********************************************************************************************************************
                                                  全局变量定义区
*********************************************************************************************************************/
/*
 * 将aCmdPrompt定义于此是为避免linker优化去除本文件中其它未显示调用命令.
 */
const char                  aCmdPrompt[] = "[ChinaOS]# ";                   /* 命令提示符                           */

/* 版本信息 --------------------------------------------------------------------------------------------------------*/
static const char           aVersionInfo[] = "\
China Operating System [版本: 1.1]\r\n\
(C)版权所有 2009-2012 Fengliang And His Friends Corporation.\r\n";

extern int                  aConsoleServices$$Base;                         /* 合并节的开始地址                     */
extern int                  aConsoleServices$$Limit;                        /* 合并节的末尾的后面的字节的地址       */

/*********************************************************************************************************************
** Function name:           service_version
** Descriptions:            系统信息服务
** Input parameters:        Option  : 服务选项
** Output parameters:       
** Returned value:          ==OK : 操作成功
**                          !=OK : 操作失败(包含出错信息)
**--------------------------------------------------------------------------------------------------------------------
** Created by:              Fengliang
** Created Date:            2010-12-13  18:38:32
** Test recorde:            
**--------------------------------------------------------------------------------------------------------------------
** Modified by:
** Modified date:
** Test recorde: 
*********************************************************************************************************************/
int version(char *Option)
{
    prints(aVersionInfo);
    
    return OK;
}
EXPORT_TO_CONSOLE("版本信息", version);

/*********************************************************************************************************************
** Function name:           time
** Descriptions:            时间命令
** Input parameters:        Option  : (保留)
** Output parameters:       
** Returned value:          ==OK : 操作成功
**                          !=OK : 操作失败(包含出错信息)
**--------------------------------------------------------------------------------------------------------------------
** Created by:              Feng Liang
** Created Date:            2012-2-8  18:4:59
** Test recorde:            
**--------------------------------------------------------------------------------------------------------------------
** Modified by:
** Modified date:
** Test recorde: 
*********************************************************************************************************************/
int time(char *Option)
{
    TIME        Time;


    //gettime(&Time);
    
    printk("当前时间: %2d:%2d:%2d\r\n", Time.Hour, Time.Minute, Time.Second);
    return OK;
}
EXPORT_TO_CONSOLE("当前时间", time);

/*********************************************************************************************************************
** Function name:           clear
** Descriptions:            清屏
** Input parameters:        
** Output parameters:       
** Returned value:          ==OK : 操作成功
**                          !=OK : 操作失败(包含出错信息)
**--------------------------------------------------------------------------------------------------------------------
** Created by:              Fengliang
** Created Date:            2010-12-13  19:38:9
** Test recorde:            
**--------------------------------------------------------------------------------------------------------------------
** Modified by:
** Modified date:
** Test recorde: 
*********************************************************************************************************************/
int clear(char *Option)
{
    printc(12);                                                             /* 清屏                                 */
    
    return OK;
}
EXPORT_TO_CONSOLE("清屏", clear);

/*********************************************************************************************************************
** Function name:           help
** Descriptions:            help服务
** Input parameters:        
** Output parameters:       
** Returned value:          ==NULL : 
**                          !=NULL : 
**--------------------------------------------------------------------------------------------------------------------
** Created by:              Fengliang
** Created Date:            2010-12-10  15:3:33
** Test recorde:            
**--------------------------------------------------------------------------------------------------------------------
** Modified by:
** Modified date:
** Test recorde: 
*********************************************************************************************************************/
int help(char *Option)
{
    SERVICE         *pService;
    SERVICE         *pStart;                                                /* 服务列表起始地址                     */
    SERVICE         *pEnd;                                                  /* 服务列表结束地址                     */


    pStart = (SERVICE*)&aConsoleServices$$Base;
    pEnd   = (SERVICE*)&aConsoleServices$$Limit;
    for(pService = pStart; pService < pEnd; pService++)
    {
        printk("%-16s:%-16s\r\n", pService->pName, pService->pDescription);
    }
    
    return OK;
}
EXPORT_TO_CONSOLE("帮助", help);

/*********************************************************************************************************************
** Function name:           count_used_stack_size
** Descriptions:            计算使用过的最大栈空间
** Input parameters:        pStackTop    : 栈顶地址
**                          pStackBottom : 栈底地址
** Output parameters:       
** Returned value:          最大栈使用空间
**--------------------------------------------------------------------------------------------------------------------
** Created by:              Feng Liang
** Created Date:            2011-12-5  1:6:27
** Test recorde:            
**--------------------------------------------------------------------------------------------------------------------
** Modified by:
** Modified date:
** Test recorde: 
*********************************************************************************************************************/
static unsigned int count_used_stack_size(REGISTER *pStackTop, REGISTER *pStackBottom)
{
    while (0 == *pStackTop)
    {
        pStackTop++;
    }
    
    return (unsigned int)pStackBottom - (unsigned int)pStackTop;
}

/*********************************************************************************************************************
** Function name:           thread
** Descriptions:            线程命令
** Input parameters:        
** Output parameters:       
** Returned value:          ==OK : 操作成功
**                          !=OK : 操作失败(包含出错信息)
**--------------------------------------------------------------------------------------------------------------------
** Created by:              Feng Liang
** Created Date:            2011-12-4  16:8:37
** Test recorde:            
**--------------------------------------------------------------------------------------------------------------------
** Modified by:
** Modified date:
** Test recorde: 
*********************************************************************************************************************/
int thread(char *Option)
{
    THREAD          *pThread;
    

    printk(" 线程号   线程名称   优先级   运行空间\r\n"
           "--------------------------------------\r\n");
    for (pThread = OS_LiveList; NULL != pThread; pThread = pThread->pLive)
    {
        printk("%8X  %-10s %6d  %4d/%-5d\r\n",
                (INT32S)pThread, 
                pThread->pName,
                pThread->Priority,
                count_used_stack_size((REGISTER*)((char*)pThread + sizeof(THREAD)), pThread->pStackBottom),
                (INT32S)pThread->pStackBottom - (INT32S)pThread - sizeof(THREAD) + sizeof(REGISTER));
    }
    
    return OK;
}
EXPORT_TO_CONSOLE("线程信息", thread);

/*********************************************************************************************************************
** Function name:           kill_thread
** Descriptions:            杀除线程
** Input parameters:        Option  : 线程号
** Output parameters:       
** Returned value:          ==OK : 操作成功
**                          !=OK : 操作失败(包含出错信息)
**--------------------------------------------------------------------------------------------------------------------
** Created by:              Feng Liang
** Created Date:            2011-12-6  0:49:4
** Test recorde:            
**--------------------------------------------------------------------------------------------------------------------
** Modified by:
** Modified date:
** Test recorde: 
*********************************************************************************************************************/
static int kill_thread(char *Option)
{
    printk("杀除线程:%s\r\n", Option);
    
    return ERR_SOFTWARE;
}
const SERVICE ServiceKill SECTION("aConsoleServices")=               \
{                                                                    \
    "kill",                                                          \
    "清除线程",                                                      \
    kill_thread                                                      \
};

/*********************************************************************************************************************
                                                    END OF FILE
*********************************************************************************************************************/

