/******************************************************Copyright (c)**************************************************
**                                              胆怯是阻止一切可能的根本缘由
**
**                                             E-Mail: ChinaFengliang@163.com
**
**---------File Information-------------------------------------------------------------------------------------------
** File name:           types.h
**
** Last version:        V1.00
** Descriptions:        系统之数据类型头文件.
** Machine info:        ARM7系列、ARM9系列、Cortex系列
**--------------------------------------------------------------------------------------------------------------------
** Created by:          Fengliang
** Created date:        2009-10-07
** Version:             V1.00
** Descriptions:        The original version
**--------------------------------------------------------------------------------------------------------------------
** Modified by:
** Modified date:
** Version:
** Descriptions:
**
*********************************************************************************************************************/
#ifndef __OS_DATA_TYPE__H
#define __OS_DATA_TYPE__H

/*********************************************************************************************************************
                                                   类型定义区
*********************************************************************************************************************/
/* 基本类型 --------------------------------------------------------------------------------------------------------*/
typedef           int               BOOL;                                   /*  布尔类型                            */
typedef    signed char              INT8S;                                  /*  有符号 8位整型                   	*/
typedef  unsigned char              INT8U;                                  /*  无符号 8位整型                   	*/
typedef    signed short             INT16S;                                 /*  有符号16位整型                  	*/
typedef  unsigned short             INT16U;                                 /*  无符号16位整型                  	*/
typedef    signed long              INT32S;                                 /*  有符号32位整型                  	*/
typedef  unsigned long              INT32U;                                 /*  无符号32位整型                  	*/
typedef    signed long long         INT64S;                                 /*  有符号64位整型                  	*/
typedef  unsigned long long         INT64U;                                 /*  无符号64位整型                  	*/
typedef           float             FP32;                                   /*  单精度浮点数(32位)              	*/
typedef           double            FP64;                                   /*  双精度浮点数(64位)              	*/
typedef           int               STATUS;                                 /*  执行状态类型                        */
typedef  unsigned long              REGISTER;                               /*  寄存器类型                          */

/* 服务类型 --------------------------------------------------------------------------------------------------------*/
struct command_t
{
    char     *pName;                                                        /* 命令名称                             */
    char     *pDescription;                                                 /* 命令描述                             */
    int     (*pFunction)(char *Option);                                     /* 命令函数                             */
};

/* 设备类型 --------------------------------------------------------------------------------------------------------*/
struct device_t
{
    char    *pName;                                                         /* 设备名称                             */
    char    *pDescription;                                                  /* 设备描述                             */
    int   (**ppSetup)(void);                                                /* 设备安装                             */
};
typedef struct device_t             DEVICE;                                 /* 设备类型                             */

#endif                                                                      /* end of __OS_DATA_TYPE__H             */
/*********************************************************************************************************************
                                                    END OF FILE
*********************************************************************************************************************/

