/******************************************************Copyright (c)**************************************************
**                                              胆怯是阻止一切可能的根本缘由
**
**                                             E-Mail: ChinaFengliang@163.com
**
**---------File Information-------------------------------------------------------------------------------------------
** File name:            memory.c
** Last version:         V1.00
** Descriptions:         .
** Hardware platform:    
** SoftWare platform:    ChinaOS
**
**--------------------------------------------------------------------------------------------------------------------
** Created by:           Feng Liang
** Created date:         2012-12-5  12:19:42
** Version:              V1.00
** Descriptions:         The original version.
**
**--------------------------------------------------------------------------------------------------------------------
** Modified by:          
** Modified date:        
** Version:              
** Descriptions:         
**
*********************************************************************************************************************/

/*********************************************************************************************************************
                                                    INPUT FILES
*********************************************************************************************************************/
#include    <include/macro.h>
#include    <include/types.h>
#include    <library/memory.h>
#include    <library/printk.h>
#include    <stdlib.h>

/*********************************************************************************************************************
                                                  MACRO DEFINITIONS
*********************************************************************************************************************/
/* section ---------------------------------------------------------------------------------------------------------*/


/*********************************************************************************************************************
                                                  TYPE DEFINITIONS
*********************************************************************************************************************/


/*********************************************************************************************************************
                                                  GLOBAL VARIABLES
*********************************************************************************************************************/
extern void                *Image$$HeapBase1$$Base;                         /* 堆区1基址                            */
extern void                *Image$$HeapBase2$$Base;                         /* 堆区2基址                            */

const struct bank         aRamBanks[] =                                     /* 内存段列表                           */
{
    {(unsigned long)&Image$$HeapBase1$$Base, 0x10008000},
    {(unsigned long)&Image$$HeapBase2$$Base, 0x20084000},
};

/*********************************************************************************************************************
** Function name:           heap
** Descriptions:            查看内存堆信息
** Input parameters:        
** Output parameters:       
** Returned value:          ==OK : 操作成功
**                          !=OK : 操作失败(包含出错信息)
**--------------------------------------------------------------------------------------------------------------------
** Created by:              Feng Liang
** Created Date:            2011-12-4  15:40:57
** Test recorde:            
**--------------------------------------------------------------------------------------------------------------------
** Modified by:
** Modified date:
** Test recorde: 
*********************************************************************************************************************/
int heap(char *Option)
{
    int         i;


    for (i = 0; i < ARRAY_SIZE(aRamBanks); i++)
    {
        printk("内存空间%d:[0x%X,0x%X) 共%dK字节\r\n", i, 
               aRamBanks[i].StartAddr, aRamBanks[i].EndAddr, 
               ((aRamBanks[i].EndAddr - aRamBanks[i].StartAddr)>>10));
    }
    
    return OK;
}
EXPORT_COMMAND("heap", "内存空间", heap);

/*********************************************************************************************************************
** Function name:           memory
** Descriptions:            查看内存分布情况
** Input parameters:        
** Output parameters:       
** Returned value:          ==OK : success.
**                          !=OK : failure.
**--------------------------------------------------------------------------------------------------------------------
** Created by:              Feng Liang
** Created Date:            2012-12-18  14:46:47
** Test recorde:            编码->走读->复查->单元测试
**--------------------------------------------------------------------------------------------------------------------
** Modified by:             
** Modified date:           
** Test recorde:            
*********************************************************************************************************************/
int memory(char *Option)
{    
    int         i;


    for (i = 0; i < ARRAY_SIZE(aRamBanks); i++)
    {
        struct chunk_head       *pChunk;
        INT32U                   End;
        char                    *pStatus;
        
        for (pChunk = (struct chunk_head *)aRamBanks[i].StartAddr; USED != pChunk->ThisInfo;
             pChunk = (struct chunk_head *)End)
        {
            End = (INT32U)pChunk + (pChunk->ThisInfo & ~USED);
            pStatus = (pChunk->ThisInfo & USED) ? "used" : "free";
            printk("内存空间: [0x%8X, 0x%8X, 0x%8X] : %s : %6d\r\n", pChunk, pChunk + 1, End - 1, pStatus, pChunk->ThisInfo & ~USED);
        }
    }
    return OK;
}
EXPORT_COMMAND("memory", "内存空间", memory);

/*********************************************************************************************************************
** Function name:           do_malloc
** Descriptions:            申请内存空间
** Input parameters:        
** Output parameters:       
** Returned value:          ==OK : success.
**                          !=OK : failure.
**--------------------------------------------------------------------------------------------------------------------
** Created by:              Feng Liang
** Created Date:            2012-12-18  16:10:11
** Test recorde:            编码->走读->复查->单元测试
**--------------------------------------------------------------------------------------------------------------------
** Modified by:             
** Modified date:           
** Test recorde:            
*********************************************************************************************************************/
int do_malloc(char *Option)
{
    void        *pMemory;
    int         Size = atoi(Option);


    pMemory = malloc(Size);
    if (pMemory == NULL)
    {
        return ERR_NO_MEMERY;
    }

    printk("分配内存空间:0x%X\r\n", pMemory);
    return OK;
}
EXPORT_COMMAND("malloc", "申请内存空间", do_malloc);

/*********************************************************************************************************************
** Function name:           do_free
** Descriptions:            释放内存空间
** Input parameters:        
** Output parameters:       
** Returned value:          ==OK : success.
**                          !=OK : failure.
**--------------------------------------------------------------------------------------------------------------------
** Created by:              Feng Liang
** Created Date:            2012-12-18  16:11:9
** Test recorde:            编码->走读->复查->单元测试
**--------------------------------------------------------------------------------------------------------------------
** Modified by:             
** Modified date:           
** Test recorde:            
*********************************************************************************************************************/
int do_free(char *Option)
{
    void        *pMemory = (void *)atoi(Option);

    
    printk("释放内存空间:0x%X\r\n", pMemory);
    free(pMemory);
    return OK;
}
EXPORT_COMMAND("free", "释放内存空间", do_free);

/*********************************************************************************************************************
                                                    END OF FILE
*********************************************************************************************************************/

