/******************************************************Copyright (c)**************************************************
**                                              胆怯是阻止一切可能的根本缘由
**
**                                             E-Mail: ChinaFengliang@163.com
**
**---------File Information-------------------------------------------------------------------------------------------
** File name:            can_filter.c
** Last version:         V1.00
** Descriptions:         can滤波器驱动文件.
** Hardware platform:
** SoftWare platform:    ChinaOS
**
**--------------------------------------------------------------------------------------------------------------------
** Created by:           Feng Liang
** Created date:         2011年12月23日  16:35:54
** Version:              V1.00
** Descriptions:         The original version
**
**--------------------------------------------------------------------------------------------------------------------
** Modified by: 
** Modified date:
** Version:
** Descriptions:
**
*********************************************************************************************************************/

/*********************************************************************************************************************
                                                    头文件区
*********************************************************************************************************************/
#include    <include/macro.h>
#include    <include/types.h>
#include    <library/ioport.h>

/*********************************************************************************************************************
                                                    宏定义区
*********************************************************************************************************************/
/* can控制器标识 ---------------------------------------------------------------------------------------------------*/
#define     CAN1              0x00                                          /* can控制器1                           */
#define     CAN2              0x01                                          /* can控制器2                           */

/* 寄存器绝对地址 --------------------------------------------------------------------------------------------------*/
#define     AFMR              0x4003C000                                    /* 验收滤波器模式寄存器                 */

#define     SFF_SA            0x4003C004                                    /* 标准帧单个起始地址寄存器             */
#define     SFF_GRP_SA        0x4003C008                                    /* 标准帧组起始地址寄存器               */
#define     EFF_SA            0x4003C00C                                    /* 扩展帧起始地址寄存器                 */
#define     EFF_GRP_SA        0x4003C010                                    /* 扩展帧组起始地址寄存器               */
#define     ENDOFTABLE        0x4003C014                                    /* AF表格结束寄存器                     */

#define     LUTERRAD          0x4003C018                                    /* LUT错误地址寄存器                    */
#define     LUTERR            0x4003C01C                                    /* LUT错误寄存器                        */

#define     FCANIE            0x4003C020                                    /* FullCAN中断寄存器                    */
#define     FCANIC0           0x4003C024                                    /* FullCAN中断与捕获寄存器0             */
#define     FCANIC1           0x4003C028                                    /* FullCAN中断与捕获寄存器1             */

#define     FILTER_RAM        0x40038000                                    /* 过滤器RAM基地址                      */

/*********************************************************************************************************************
                                                    类型定义区
*********************************************************************************************************************/
/* 基本类型 --------------------------------------------------------------------------------------------------------*/


/*********************************************************************************************************************
                                                  全局变量定义区
*********************************************************************************************************************/
static int          InitCounter = 0;                                        /* 初始化计数器                         */

/* 过滤列表(标准消息报文) ------------------------------------------------------------------------------------------*/
static  INT16U aStandardID[] = 
{
    /* 
     * 注意: 必须以小到大的方式排序
     */
    (CAN2<<13) | 0x000,
    (CAN2<<13) | 0x555,
    (CAN2<<13) | 0x701,
    (CAN2<<13) | 0x7f5,
};

/* 过滤列表(扩展消息报文) ------------------------------------------------------------------------------------------*/
#if 0
static const INT32U aExtendedID[] = 
{
    (CAN2<<29) | 0x12111111,
};
#endif

/*********************************************************************************************************************
** Function name:           can_filter_setup
** Descriptions:            安装can接收过滤器
** Input parameters:        
** Output parameters:       
** Returned value:          ==OS_OK : 操作成功
**                          !=OS_OK : 操作失败(包含出错信息)
**--------------------------------------------------------------------------------------------------------------------
** Created by:              Feng Liang
** Created Date:            2011-12-23  16:37:21
** Test recorde:            
**--------------------------------------------------------------------------------------------------------------------
** Modified by:
** Modified date:
** Test recorde: 
*********************************************************************************************************************/
int can_filter_setup(void)
{   
    int                 i;
    INT32U              Address;


    /*
     * 由于CAN1与CAN2共用同一个CAN报文过滤器,为防止重复安装CAN报文过滤器.
     */
    if (0 != InitCounter)
    {
        return OK;
    }
    InitCounter++;
    
    write_dword(AFMR, 0x01);                                                /* 进入关闭模式(所有消息报文都将被拒收) */

    /* 1)
     * 添加滤波标识符项目
     */
    Address = FILTER_RAM;
    for (i = 0; i < sizeof(aStandardID)/sizeof(INT32U); i++)
    {
        int     Index = i << 1;
        
        write_dword(Address, (aStandardID[Index] << 16) |
                              aStandardID[Index + 1]);                      /* 硬件规定只能以字的方式访问           */
        Address += 4;
    }
    
    /* 2)
     * 设置边界寄存器 
     */
    write_dword(SFF_SA, 0);                                                 /* 设置散列标准标识符起始地址           */
    write_dword(SFF_GRP_SA, sizeof(aStandardID) / sizeof(INT8U));           /* 设置组列标准标识符起始地址           */
    write_dword(EFF_SA,     sizeof(aStandardID) / sizeof(INT8U));           /* 设置散列扩展标识符起始地址           */
    write_dword(EFF_GRP_SA, sizeof(aStandardID) / sizeof(INT8U));           /* 设置组列扩展标识符起始地址           */
    write_dword(ENDOFTABLE, sizeof(aStandardID) / sizeof(INT8U));           /* 设置滤波表线束地址                   */

    write_dword(AFMR, 0x00);                                                /* 进入工作模式(仅接收过滤后的消息报文) */

    return OK;
}

/*********************************************************************************************************************
                                                    END OF FILE
*********************************************************************************************************************/

