/******************************************************Copyright (c)**************************************************
**                                              胆怯是阻止一切可能的根本缘由
**
**                                             E-Mail: ChinaFengliang@163.com
**
**---------File Information-------------------------------------------------------------------------------------------
** File name:           interrupt.c
** Last version:        V1.00
** Descriptions:        中断管理文件.
** Hardware platform:   LPC1766 (Cortex-M3内核)
** SoftWare platform:   ChinaOS操作系统
**
**--------------------------------------------------------------------------------------------------------------------
** Created by:          Fengliang
** Created date:        17:11 2010年7月14日
** Version:             V1.00
** Descriptions:        The original version
**
**--------------------------------------------------------------------------------------------------------------------
** Modified by:
** Modified date:
** Version:
** Descriptions:
**
*********************************************************************************************************************/

/*********************************************************************************************************************
                                                   头文件区
*********************************************************************************************************************/
#include    <include/macro.h>
#include    <include/types.h>
#include    <library/ioport.h>
#include    <library/bit/bit.h>
#include    "../nxp/lpc17xx.h"
#include    "../../../syscall.h"
#include    "./interrupt.h"

/*********************************************************************************************************************
                                                   宏定义区
*********************************************************************************************************************/
#define     SERVICE_TABLE_LOCKED    0                                       /* 中断服务列表固化配置(0:可变; 1:固化) */
#define     SETENA_BASE             0xE000E100                              /* 中断使能寄存器组基址                 */
#define     CLRENA_BASE             0xE000E180                              /* 中断禁能寄存器组基址                 */
#define     SETPEND_BASE            0xE000E200                              /* 中断设置悬起寄存器组基址             */
#define     CLRPEND_BASE            0xE000E200                              /* 中断清除悬起寄存器组基址             */
#define     PRIORITY_REGS_BASE      0xE000E400                              /* 中断优先级寄存器陈列基址             */
#define     ACTIVE_BASE             0xE000E300                              /* 中断活动状态寄存器组基址             */
#define     SHCSR_BASE              0xE000ED24                              /* 其它异常配置寄存器                   */

/*********************************************************************************************************************
                                                   类型定义区
*********************************************************************************************************************/


/*********************************************************************************************************************
                                                   全局变量定义区
*********************************************************************************************************************/
static      char                    LowBitIndex;                            /* 优先级有效位的最低位索引             */

/*********************************************************************************************************************
** Function name:           read_priority_bits
** Descriptions:            读取硬件实现的优先级有效位索引
** Input parameters:        
** Output parameters:       
** Returned value:          优先级寄存器有效位数
**--------------------------------------------------------------------------------------------------------------------
** Created by:              Fengliang
** Created Date:            2011-5-22  17:20:42
** Test recorde:            3 = read_priority_bits();
**--------------------------------------------------------------------------------------------------------------------
** Modified by:
** Modified date:
** Test recorde: 
*********************************************************************************************************************/
static int read_priority_bits(void)
{   
    INT32U          Bitmap;                                                 /* 硬件优先级位图                       */

    write_byte(0xE000E400, 0xFF);                                           /* 设置优先级寄存器所有位               */
    Bitmap = read_byte(0xE000E400);

    return bit_scan_forward(Bitmap);
}

/*********************************************************************************************************************
** Function name:           vic_setup
** Descriptions:            安装中断控制器
** Input parameters:        
** Output parameters:       
** Returned value:          ==OK : 操作成功
**                          !=OK : 操作失败(包含出错信息)
**--------------------------------------------------------------------------------------------------------------------
** Created by:              Fengliang
** Created Date:            2011-5-22  17:20:42
** Test recorde:            
**--------------------------------------------------------------------------------------------------------------------
** Modified by:
** Modified date:
** Test recorde: 
*********************************************************************************************************************/
int vic_setup(void)
{
    INT8U           *pSysPriority = (INT8U *)0xE000ED18;                    /* 系统异常优先级寄存器组               */


    LowBitIndex = read_priority_bits();
    /* 
     * 设置优先级组 (lpc1766优先级位[7, 3], 共5位)
     * 抢占优先级表达位段: [3, 7]
     * 表达子优先级的位段: [0, 2]
     */
    write_dword(0xE000ED0C, 0x05FA0200); 
    
    /*
     * 设置系统异常优先级和使能
     */
    /* 设置系统异常优先级 */
    pSysPriority[0]  = 0x00 << LowBitIndex;                                 /* MemManage fault优先级:               */
    pSysPriority[1]  = 0x00 << LowBitIndex;                                 /* 总线fault优先级:                     */
    pSysPriority[2]  = 0x00 << LowBitIndex;                                 /* 用法fault优先级:                     */
    pSysPriority[7]  = 0x00 << LowBitIndex;                                 /* SVC优先级:                           */
    pSysPriority[8]  = 0x00 << LowBitIndex;                                 /* 调试监视器优先级:                    */       
    pSysPriority[10] = 0xFF << LowBitIndex;                                 /* PendSV优先级: 最低                   */
    pSysPriority[11] = 0x02 << LowBitIndex;                                 /* Systick优先级:                       */

    return OK;
}

/*********************************************************************************************************************
** Function name:           irq_register
** Descriptions:            注册设备中断服务
** Input parameters:        Device     : 设备中断通道号
**                          Priority   : 优先级 [0(高优先级), 31(低优先级)]
**                          pException : 服务函数
** Output parameters:       
** Returned value:          == OK  : 操作成功
**                          != OK  : 出错信息
**--------------------------------------------------------------------------------------------------------------------
** Created by:              Fengliang
** Created Date:            14:47 2010年7月7日星期三
** Test recorde:
**--------------------------------------------------------------------------------------------------------------------
** Modified by:
** Modified date:
** Test recorde:
*********************************************************************************************************************/
int irq_register(enum irq_t Device,  INT32U Priority, void (*pException)(void))
{
    INT8U          *pPriority = (INT8U  *)0xE000E400;                       /* 设备优先级寄存器组                   */
    INT32U         *pEnable   = (INT32U *)0xE000E100;                       /* 使能寄存器组                         */
    int             Offset;                                                 /* 寄存器偏移量                         */
    int             Index;                                                  /* 使能位索引值                         */

    /* 
     * 0) 参数过滤
     */
    if (NULL == pException)
    {
        return ERR;
    }
     
    
    /* 
     * 1) 设置中断服务地址
     *    如果中断服务地址已经固化在ROM中, 则此步骤可以省略
     */
#if LOAD_IN_RAM
    {
        INT32U  Vtor = regist32_read(0xE000ED08);                           /* 读取向量表偏移量寄存器               */
        if (Vtor & (1ul<<29))                                               /* 向量表在RAM区                        */
        {
                    
        }
    }
#endif

    /*
     * 2) 设置中断服务优先级
     */
    pPriority[Device] = (INT8U)(Priority << LowBitIndex);

    /* 
     * 3) 使能设备中断
     */
    Offset = Device >> 5;
    Index  = Device & 31;
    pEnable[Offset] = 1ul << Index;                                         /* 使能设备中断                         */
    
    return OK;
}

/*********************************************************************************************************************
** Function name:           irq_unregister
** Descriptions:            注销设备中断服务
** Input parameters:        Device    : 设备号
** Output parameters:       
** Returned value:          == OK  : 操作成功
**                          != OK  : 出错信息
**--------------------------------------------------------------------------------------------------------------------
** Created by:              Fengliang
** Created Date:            14:47 2010年7月7日星期三
** Test recorde:
**--------------------------------------------------------------------------------------------------------------------
** Modified by:
** Modified date:
** Test recorde:
*********************************************************************************************************************/
int irq_unregister(enum irq_t Device)
{
    INT32U         *pDisable = (INT32U *)0xE000E180;                        /* 禁能寄存器组                         */
    int             Offset;                                                 /* 寄存器偏移量                         */
    int             Index;                                                  /* 使能位索引值                         */


    Offset = Device >> 5;
    Index  = Device & 31;
    pDisable[Offset] = 1ul << Index;                                        /* 禁能设备中断                         */

    return OK;
}


/*********************************************************************************************************************
                                                   END OF FILE
*********************************************************************************************************************/

