/******************************************************Copyright (c)**************************************************
**                                              胆怯是阻止一切可能的根本缘由
**
**                                             E-Mail: ChinaFengliang@163.com
**
**---------File Information-------------------------------------------------------------------------------------------
** File name:            cc.h
** Last version:         V1.00
** Descriptions:         编译器相关定义文件.
** Hardware platform:    
** SoftWare platform:    ChinaOS & lwip
**
**--------------------------------------------------------------------------------------------------------------------
** Created by:           Feng Liang
** Created date:         2012年2月8日  15:6:8
** Version:              V1.00
** Descriptions:         The original version
**
**--------------------------------------------------------------------------------------------------------------------
** Modified by: 
** Modified date:
** Version:
** Descriptions:
**
*********************************************************************************************************************/
#ifndef __CC_H_
#define __CC_H_

#ifdef __cplusplus
extern "C" {
#endif                                                                      /* __cplusplus                          */

/*********************************************************************************************************************
                                                    头文件区
*********************************************************************************************************************/
#include    <include/macro.h>
#include    <include/types.h>
#include    <library/sysio/sysio.h>

/*********************************************************************************************************************
                                                    宏定义区
*********************************************************************************************************************/
/* 宏段名 ----------------------------------------------------------------------------------------------------------*/
#if   defined(__CC_ARM)                                                     /* ARMCC compiler                       */
#define     PACK_STRUCT_FIELD(x) x
#define     PACK_STRUCT_STRUCT __attribute__ ((__packed__))
#define     PACK_STRUCT_BEGIN
#define     PACK_STRUCT_END
#elif defined(__IAR_SYSTEMS_ICC__)                                          /* IAR Compiler                         */
#define     PACK_STRUCT_BEGIN
#define     PACK_STRUCT_STRUCT
#define     PACK_STRUCT_END
#define     PACK_STRUCT_FIELD(x) x
#define     PACK_STRUCT_USE_INCLUDES
#elif defined(__GNUC__)                                                     /* GNU GCC Compiler                     */
#define     PACK_STRUCT_FIELD(x) x
#define     PACK_STRUCT_STRUCT __attribute__((packed))
#define     PACK_STRUCT_BEGIN
#define     PACK_STRUCT_END
#endif

/* 宏段名 ----------------------------------------------------------------------------------------------------------*/
#define     LWIP_PROVIDE_ERRNO                      1                       /* 由lwip提供错误编码                   */
/* 宏段名 ----------------------------------------------------------------------------------------------------------*/
#define     LWIP_PLATFORM_DIAG(x)                   prints(x)               /* 调试信息                             */
#define     LWIP_PLATFORM_ASSERT(x)                 prints(x)               /* 断言                                 */
/* 宏段名 ----------------------------------------------------------------------------------------------------------*/
#define     U16_F       "hu"
#define     S16_F       "hd"
#define     X16_F       "hx"
#define     U32_F       "lu"
#define     S32_F       "ld"
#define     X32_F       "lx"

/*********************************************************************************************************************
                                                    类型定义区
*********************************************************************************************************************/
/* 基本类型 --------------------------------------------------------------------------------------------------------*/
typedef     INT8U                   u8_t;
typedef     INT8S                   s8_t;
typedef     INT16U                  u16_t;
typedef     INT16S                  s16_t;
typedef     INT32U                  u32_t;
typedef     INT32S                  s32_t;
typedef     INT32U                  mem_ptr_t;


#ifdef __cplusplus
}
#endif                                                                      /* __cplusplus                          */

#endif                                                                      /* end of __CC_H_                       */
/*********************************************************************************************************************
                                                    END OF FILE
*********************************************************************************************************************/

