/******************************************************Copyright (c)**************************************************
**                                              胆怯是阻止一切可能的根本缘由
**
**                                             E-Mail: ChinaFengliang@163.com
**
**---------File Information-------------------------------------------------------------------------------------------
** File name:            uart.c
** Last version:         V1.00
** Descriptions:         uart设备类驱动文件.
** Hardware platform:    LPC24xx
** SoftWare platform:
**
**--------------------------------------------------------------------------------------------------------------------
** Created by:           Fengliang
** Created date:         2010年9月25日  13:47:55
** Version:              V1.00
** Descriptions:         The original version
**
**--------------------------------------------------------------------------------------------------------------------
** Modified by:
** Modified date:
** Version:
** Descriptions:
**
*********************************************************************************************************************/

/*********************************************************************************************************************
                                                    头文件区
*********************************************************************************************************************/
#include    <include/macro.h>
#include    <include/types.h>
#include    <library/ioport.h>
#include    "../../lpc17xx.h"
#include    "./uart.h"

/*********************************************************************************************************************
                                                    宏定义区
*********************************************************************************************************************/
/* 配置参数 --------------------------------------------------------------------------------------------------------*/
#define   Fin          12500000                                             /* uart输入信号频率: 12500000(单位: HZ) */
#define   Fout           115200                                             /* uart输出信号特率: 115200  (单位: HZ) */
/* 分配系数(由工具计算生成) ----------------------------------------------------------------------------------------*/
#define   DLi               5ul                                             /* 整数分频系数i                        */
#define   DLm              14ul                                             /* 小数分频系数m                        */
#define   DLn               5ul                                             /* 小数分频系数n                        */

/* 寄存器偏移地址 --------------------------------------------------------------------------------------------------*/
#define   RBR              0x00
#define   THR              0x00
#define   DLL              0x00
#define   DLM              0x04
#define   IER              0x04
#define   IIR              0x08
#define   FCR              0x08
#define   LCR              0x0C

#define   LSR              0x14
#undef    SCR
#define   SCR              0x1C
#define   ACR              0x20

#define   FDR              0x28
#define   TER              0x30

/*********************************************************************************************************************
                                                    类型定义区
*********************************************************************************************************************/
/* 基本类型 --------------------------------------------------------------------------------------------------------*/


/*********************************************************************************************************************
                                                  全局变量定义区
*********************************************************************************************************************/



/*********************************************************************************************************************
** Function name:           uart_setup
** Descriptions:            安装uart类设备
** Input parameters:        This  : 设备特征清单指针
**                          Speed : 通信频率(单位: Hz)
** Output parameters:
** Returned value:
**--------------------------------------------------------------------------------------------------------------------
** Created by:              Fengliang
** Created Date:            2010-9-25  13:49:39
** Test recorde:
**--------------------------------------------------------------------------------------------------------------------
** Modified by:
** Modified date:
** Test recorde:
*********************************************************************************************************************/
int uart_setup(const UART_INFO *This, int Speed)
{             
    INT32U          BaseAddress;                                            /* 寄存器基址                           */
    
    
    BaseAddress = This->BaseAddress;
    write_dword(BaseAddress + LCR, (3ul << 0) |                             /* 初始化帧格式                         */
                                   (0ul << 2) |
                                   (0ul << 3) |
                                   (0ul << 4) |
                                   (0ul << 6) |
                                   (0ul << 7));

    dword_set_bits(BaseAddress + FCR, (1ul << 0) |                          /* 使能FIFO                             */
                                      (1ul << 2));                          /* 复位FIFO                             */
    dword_set_bits(BaseAddress + LCR, 1ul << 7);                            /* 解锁除法器                           */
    
    /*
     * 设置分频系数
     */
    write_dword(BaseAddress + DLM, DLi>>8);
    write_dword(BaseAddress + DLL, DLi&0xFF);
    write_dword(BaseAddress + FDR, (DLm<<4) | (DLn<<0));                    /* 小数分频系数                         */
    dword_clear_bits(BaseAddress + LCR, 1ul<<7);                            /* 锁定除法器                           */
    
    return OK;
}

/*********************************************************************************************************************
** Function name:           uart0_cleanup
** Descriptions:            卸载uart0设备
** Input parameters:
** Output parameters:
** Returned value:
**--------------------------------------------------------------------------------------------------------------------
** Created by:              Fengliang
** Created Date:            2010-9-25  13:49:39
** Test recorde:
**--------------------------------------------------------------------------------------------------------------------
** Modified by:
** Modified date:
** Test recorde:
*********************************************************************************************************************/
void uart_cleanup(const UART_INFO *This)
{
    
}

/*********************************************************************************************************************
** Function name:           getchar
** Descriptions:            输入字符
** Input parameters:        
** Output parameters:       
** Returned value:          输入字符
**--------------------------------------------------------------------------------------------------------------------
** Created by:              Fengliang
** Created Date:            2010-12-9  10:58:4
** Test recorde:            
**--------------------------------------------------------------------------------------------------------------------
** Modified by:
** Modified date:
** Test recorde: 
*********************************************************************************************************************/
INT32S uart_recv(const UART_INFO *This, char *pBuffer, int Size)
{
    /* 
     * 以查询方式从缓冲区中读取一个字符.
     * A) 缓冲区满，则返回字符;
     * B) 缓冲区空, 则等待输入.
     */
    INT32U          BaseAddress;                                            /* 寄存器基址                           */

    BaseAddress = This->BaseAddress;
    
    /*
     * 等待FIFO非空闲
     */
    while (0x00 == (read_dword(BaseAddress + LSR) & 0x01))
    {
        ;
    }

    *pBuffer = (char)read_dword(BaseAddress + RBR);                         /* 输入数据                             */
    
    return OK;
}

/*********************************************************************************************************************
** Function name:           putchar
** Descriptions:            输出字符
** Input parameters:        Char    : 输出字符
** Output parameters:       
** Returned value:          ==OK : 操作成功
**                          !=OK : 操作失败(包含出错信息)
**--------------------------------------------------------------------------------------------------------------------
** Created by:              Fengliang
** Created Date:            2010-12-9  10:53:33
** Test recorde:            
**--------------------------------------------------------------------------------------------------------------------
** Modified by:
** Modified date:
** Test recorde: 
*********************************************************************************************************************/
INT32S uart_send(const UART_INFO *This, char *pBuffer, int Size)
{
    /*
     * 以查询方式输出
     */
    INT32U          BaseAddress;                                            /* 寄存器基址                           */

    BaseAddress = This->BaseAddress;
    
    /*
     * 等待FIFO空闲
     */
    while(!(read_dword(BaseAddress + LSR) & (0x01<<5)))
    {
        ;
    }
    write_dword(BaseAddress + THR, *pBuffer);                               /* 发送字符                             */
    
    return OK;
}

/*********************************************************************************************************************
                                                    END OF FILE
*********************************************************************************************************************/

