/******************************************************Copyright (c)**************************************************
**
**                              Copyright (c) 2009,2011 Fengliang And His Friends Corporation.
**
**                                             E-Mail: ChinaFengliang@163.com
**
**
**---------File Information-------------------------------------------------------------------------------------------
** File name:            main.c
** Last version:         V1.00
** Descriptions:         文件系统测试用例.
** Hardware platform:    
** SoftWare platform:
**
**--------------------------------------------------------------------------------------------------------------------
** Created by:           FengLiang
** Created date:         2011年10月11日  0:4:57
** Version:              V1.00
** Descriptions:         The original version
**
**--------------------------------------------------------------------------------------------------------------------
** Modified by: 
** Modified date:
** Version:
** Descriptions:
**
*********************************************************************************************************************/

/*********************************************************************************************************************
                                                    头文件区
*********************************************************************************************************************/
#include "stdafx.h"
#include "macro.h"
#include "type.h"
#include "ff.h"

/*********************************************************************************************************************
                                                    宏定义区
*********************************************************************************************************************/
/* 宏段名 ----------------------------------------------------------------------------------------------------------*/


/*********************************************************************************************************************
                                                    类型定义区
*********************************************************************************************************************/
/* 基本类型 --------------------------------------------------------------------------------------------------------*/


/*********************************************************************************************************************
                                                  全局变量定义区
*********************************************************************************************************************/


/*********************************************************************************************************************
** Function name:           main
** Descriptions:            
** Input parameters:        
** Output parameters:       
** Returned value:          ==OS_OK : 操作成功
**                          !=OS_OK : 操作失败(包含出错信息)
**--------------------------------------------------------------------------------------------------------------------
** Created by:              Fengliang
** Created Date:            2011-5-16  13:23:42
** Test recorde:            
**--------------------------------------------------------------------------------------------------------------------
** Modified by:
** Modified date:
** Test recorde: 
*********************************************************************************************************************/
int main(int argc, _TCHAR* argv[]) 
{ 
    char aWriteBuffer[] = "精诚服务，真诚永远！——源于China";              	/* 文件内容                             */
    char aReadBuffer[1024];

    FATFS   fs[1];                                                          /* Work area for logical drives         */
    FRESULT Status;                                                         /* 操作状态                             */
    FIL     SrcFile, DstFile;                                               /* file objects                         */
    UINT    ReadCounter, WriteCounter;                                      /* File read counter                    */


    /*
     * 1) Register work area for each volume (Always succeeds regardless of disk status)
     */
    f_mount(0, &fs[0]);

#if 0
    f_mkfs(0, 1, 512);
#endif

    /*
     * 2) 创建目录.
     */
    f_mkdir("0:ChinaOS");


    /* 
     * 3) 打开文件 on the drive 0
     */
    Status = f_open(&SrcFile, "0:hello.txt", FA_OPEN_EXISTING | FA_READ);
    if (OS_OK != Status)
    {
        printf("Could not find the src file\n");
    }

    Status = f_open(&DstFile, "0:ChinaOS中国操作系统.txt", FA_CREATE_ALWAYS | FA_WRITE);
    if (OS_OK != Status)
    {
        printf("Could not find the dest file\n");
    }

    /*
     * 4) 复制文件数据.
     */
    while (1)
    {
        Status = f_read(&SrcFile, aReadBuffer, sizeof(aReadBuffer), &ReadCounter);
        if (OS_OK != Status || ReadCounter == 0)
        {
            break;                                                          /* error or eof                         */
        }

        /* Copy source to destination */
        Status = f_write(&DstFile, aReadBuffer, ReadCounter, &WriteCounter);
        if (OS_OK != Status || WriteCounter < ReadCounter) 
        {
            break;                                                          /* error or disk full                   */
        }
    }

    /*
     * 5) Close open files
     */
    f_close(&SrcFile);
    f_close(&DstFile);
    
    /*
     * 6) Unregister work area prior to discard it.
     */
    f_unmount(0);

    return 0; 
}


/*********************************************************************************************************************
                                                    END OF FILE
*********************************************************************************************************************/

