/******************************************************Copyright (c)**************************************************
**                                              胆怯是阻止一切可能的根本缘由
**
**                                             E-Mail: ChinaFengliang@163.com
**
**---------File Information-------------------------------------------------------------------------------------------+
** File name:            device.c
** Last version:         V1.00
** Descriptions:         设备管理文件.
** Hardware platform:    lpc1768
** SoftWare platform:    ChinaOS
**
**--------------------------------------------------------------------------------------------------------------------
** Created by:           FengLiang
** Created date:         2010年8月25日  14:27:47
** Version:              V1.00
** Descriptions:         The original version
**
**--------------------------------------------------------------------------------------------------------------------
** Modified by:
** Modified date:
** Version:
** Descriptions:
**
*********************************************************************************************************************/
#define     DEBUG_LOCAL_EN                          1                       /* 本地调试开关: 0:关; 1:开             */
/*********************************************************************************************************************
                                                   头文件区
*********************************************************************************************************************/
#include    <include/macro.h>
#include    <include/types.h>
#include    <include/debug.h>
#include    "./device.h"


/*********************************************************************************************************************
                                                   全局变量定义区
*********************************************************************************************************************/
extern int                  aDeviceList$$Base;                              /* 合并节的开始地址                     */
extern int                  aDeviceList$$Limit;                             /* 合并节的末尾的后面的字节的地址       */


/*********************************************************************************************************************
** Function name:           device_setup
** Descriptions:            安装系统默认设备
** Input parameters:        
** Output parameters:       
** Returned value:          ==OK : 操作成功
**                          !=OK : 操作失败(包含出错信息)
**--------------------------------------------------------------------------------------------------------------------
** Created by:              Fengliang
** Created Date:            2010-8-24  15:57:4
** Test recorde:
**--------------------------------------------------------------------------------------------------------------------
** Modified by:
** Modified date:
** Test recorde:
*********************************************************************************************************************/
int device_setup(void)
{
    DEVICE             *pDevice;                                            /* 设备表项                             */


    for (pDevice = (DEVICE*)&aDeviceList$$Base; pDevice < (DEVICE*)&aDeviceList$$Limit; pDevice++)
    {
        int                 Status;                                         /* 设备安装信息                         */        
        int               (*pSetup)(void);                                  /* 设备安装函数                         */
        
        pSetup = *(pDevice->ppSetup);
        Status = (*pSetup)();
        if (OK != Status)
        {
            DBG_WARN("安装%s设备失败: %d\r\n", pDevice->pName, Status);
        }
    }

    return OK;
}

/*********************************************************************************************************************
** Function name:           device_clearup
** Descriptions:            
** Input parameters:        
** Output parameters:       
** Returned value:          ==OK : success.
**                          !=OK : failure.
**--------------------------------------------------------------------------------------------------------------------
** Created by:              Feng Liang
** Created Date:            2012-11-26  19:13:13
** Test recorde:            编码->走读->复查->单元测试
**--------------------------------------------------------------------------------------------------------------------
** Modified by:             
** Modified date:           
** Test recorde:            
*********************************************************************************************************************/
void device_clearup()
{
}

/*********************************************************************************************************************
** Function name:           dopen
** Descriptions:            打开设备文件
** usage:                   dopen(3, Device, [Option1], [Option2], [Option3], ...);
** Input parameters:        Num    : 配置个数(必须项)
**                          Device : 指定访问目标设备(必要项);
**                          Option : 指定打开操作选项(可选项);
** Output parameters:       none
** Returned value:          ==NULL : 操作失败
**                          !=NULL : 操作成功(包含设备文件)
**--------------------------------------------------------------------------------------------------------------------
** Created by:              Fengliang
** Created Date:            2010-10-18  16:7:51
** Test recorde:            
**--------------------------------------------------------------------------------------------------------------------
** Modified by:
** Modified date:
** Test recorde:
*********************************************************************************************************************/
void *dopen(const char *DeviceName, void *Config, int Mode)
{
    return NULL;
}

/*********************************************************************************************************************
** Function name:           dclose
** Descriptions:            关闭设备文件
** usage:                   dclose(3, Device, [Option1], [Option2], [Option3], ...);
** Input parameters:        Num      : 配置个数(必须项)
**                          Device   : 设备索引(必须项)
**                          Option   : 具体配置(可选项)
** Output parameters:       
** Returned value:          ==OK : 操作成功
**                          !=OK : 操作失败(包含出错信息)
**--------------------------------------------------------------------------------------------------------------------
** Created by:              Fengliang
** Created Date:            2010-10-18  16:7:51
** Test recorde:            正 常
**--------------------------------------------------------------------------------------------------------------------
** Modified by:
** Modified date:
** Test recorde:
*********************************************************************************************************************/
int dclose(void *Device)
{
    return 0;
}

/*********************************************************************************************************************
** Function name:           dread
** Descriptions:            读标准设备
** usage:                   dread(3, Device, [Option1], [Option2], [Option3], ...);
** Input parameters:        Num     : 配置个数(必须项)
**                          Device  : 设备索引(必须项)
**                          Option  : 具体配置(可选项)
** Output parameters:       none
** Returned value:          ==OK : 操作成功
**                          !=OK : 操作失败(包含出错信息)
**--------------------------------------------------------------------------------------------------------------------
** Created by:              Fengliang
** Created Date:            2010-10-19  17:2:15
** Test recorde:            正 常
**--------------------------------------------------------------------------------------------------------------------
** Modified by:
** Modified date:
** Test recorde:
*********************************************************************************************************************/
INT32S dread(INT32U Num, INT32U Device)
{
}

/*********************************************************************************************************************
** Function name:           dwrite
** Descriptions:            写标准设备
** usage:                   dwrite(3, Device, [Option1], [Option2], [Option3], ...);
** Input parameters:        Num     : 配置个数(必须项)
**                          Device  : 设备索引(必须项)
**                          Option  : 具体配置(可选项)
** Output parameters:       none
** Returned value:          ==OK : 操作成功
**                          !=OK : 操作失败(包含出错信息)
**--------------------------------------------------------------------------------------------------------------------
** Created by:              Fengliang
** Created Date:            2010-10-19  17:2:20
** Test recorde:            正 常
**--------------------------------------------------------------------------------------------------------------------
** Modified by:
** Modified date:
** Test recorde:
*********************************************************************************************************************/
INT32S dwrite(INT32U Num, INT32U Device)
{
}

/*********************************************************************************************************************
** Function name:           ioctl
** Descriptions:            
** Input parameters:        
** Output parameters:       
** Returned value:          ==OK : success.
**                          !=OK : failure.
**--------------------------------------------------------------------------------------------------------------------
** Created by:              Feng Liang
** Created Date:            2012-11-26  19:13:32
** Test recorde:            编码->走读->复查->单元测试
**--------------------------------------------------------------------------------------------------------------------
** Modified by:             
** Modified date:           
** Test recorde:            
*********************************************************************************************************************/
int dioctl()
{
}

/*********************************************************************************************************************
                                                   END OF FILE
*********************************************************************************************************************/
